Repository: b14ckPanther/BudgetPal
Catalog: lib/l10n/app_*.arb
Languages: he

# authWelcome
source: Welcome back
he: ברוך הבא

# authRegisterTitle
source: Create your account
he: צור חשבון

# emailLabel
source: Email
he: אימייל

# passwordLabel
source: Password
he: סיסמה

# confirmPasswordLabel
source: Confirm password
he: אשר סיסמה

# signInButton
source: Sign in
he: התחבר

# signUpButton
source: Sign up
he: הירשם

# toggleToRegister
source: Need an account? Register
he: אין לך חשבון? הירשם

# toggleToLogin
source: Already have an account? Sign in
he: כבר יש לך חשבון? התחבר

# rememberMeLabel
source: Remember me on this device
he: זכור אותי במכשיר זה

# forgotPasswordLink
source: Forgot password?
he: שכחת סיסמה?

# authIdentifierLabel
source: Email or username
he: דוא״ל או שם משתמש

# authIdentifierHelper
source: You can enter your email address or username.
he: אפשר להזין כתובת דוא״ל או שם משתמש.

# authIdentifierRequired
source: Enter your email address or username.
he: הזן כתובת דוא״ל או שם משתמש.

# usernameLabel
source: Username
he: שם משתמש

# usernameHelper
source: 3+ characters. Letters, numbers, dot, dash, or underscore.
he: לפחות 3 תווים: אותיות, מספרים, נקודה, מקף או קו תחתון.

# usernameRequiredError
source: Choose a username.
he: בחר שם משתמש.

# usernameInvalidError
source: Use at least 3 characters (letters, numbers, dot, dash, underscore).
he: השתמש בלפחות 3 תווים (אותיות, מספרים, נקודה, מקף או קו תחתון).

# passwordResetTitle
source: Reset password
he: איפוס סיסמה

# passwordResetDescription
source: Enter your email to receive a password reset link.
he: הזן את האימייל כדי לקבל קישור לאיפוס הסיסמה.

# passwordResetSendButton
source: Send reset link
he: שלח קישור לאיפוס

# passwordResetSuccess
source: Password reset email sent. Check your inbox.
he: אימייל לאיפוס סיסמה נשלח. בדוק את תיבת הדואר.

# retryButtonLabel
source: Try again
he: נסו שוב

# logoutButton
source: Sign out
he: התנתק

# loadingLabel
source: Loading...
he: טוען...

# themeToggleLabel
source: Theme
he: ערכת נושא

# languageSelectorLabel
source: Language
he: שפה

# invalidEmailError
source: Enter a valid email address
he: נא להזין כתובת אימייל תקינה

# passwordMismatchError
source: Passwords do not match
he: הסיסמאות אינן תואמות

# passwordTooShortError
source: Password must be at least 6 characters
he: הסיסמה חייבת לכלול לפחות 6 תווים

# unknownError
source: Something went wrong
he: אירעה שגיאה

# genericLoadError
source: We couldn't load this right now.
he: לא הצלחנו לטעון את הנתונים כעת.

# closeButtonTooltip
source: Close
he: סגירה

# passwordToggleShow
source: Show password
he: הצג סיסמה

# passwordToggleHide
source: Hide password
he: הסתר סיסמה

# navHome
source: Home
he: בית

# navTransactions
source: Transactions
he: תנועות

# navBudget
source: Budget
he: תקציב

# navAssistant
source: Assistant
he: עוזר

# navProfile
source: Profile
he: פרופיל

# homeOverviewTitle
source: Personal Finance Overview
he: סקירת פיננסים אישיים

# homeOverviewSubtitle
source: Monitor your budgets, spending, and goals at a glance.
he: עקבו אחר התקציבים, ההוצאות והיעדים במבט אחד.

# homePlaceholder
source: Dashboard widgets coming soon.
he: ווידג'טים של לוח המחוונים בדרך.

# transactionsTitle
source: Transactions
he: תנועות

# transactionsSubtitle
source: Review recent activity, add purchases, and process invoices.
he: בדקו פעילות אחרונה, הוסיפו רכישות ועבדו חשבוניות.

# transactionsPlaceholder
source: Transaction list coming soon.
he: רשימת התנועות תוצג כאן בקרוב.

# transactionsAddButton
source: Add transaction
he: הוספת תנועה

# transactionsImportInvoice
source: Process invoice (AI)
he: עיבוד חשבונית (בינה)

# transactionsImportCamera
source: Capture invoice photo
he: צלם חשבונית

# transactionsImportGallery
source: Choose from gallery
he: בחר מהגלריה

# transactionsSearchHint
source: Search notes or merchants
he: חיפוש הערות או בתי עסק

# transactionsAiPickError
source: We couldn't access the camera or gallery. Check permissions and try again.
he: לא הצלחנו לגשת למצלמה או לגלריה. בדקו הרשאות ונסו שוב.

# transactionsFilterReset
source: Clear filters
he: ניקוי סינונים

# transactionsEmptyTitle
source: No transactions yet
he: אין תנועות עדיין

# transactionsEmptySubtitle
source: Start by adding your recent spending or income to stay on top of cash flow.
he: התחילו בהוספת הוצאות או הכנסות אחרונות כדי לעקוב אחר התזרים.

# transactionsDateToday
source: Today
he: היום

# transactionsDateYesterday
source: Yesterday
he: אתמול

# transactionsDateEarlier
source: Earlier
he: קודם

# transactionTypeExpense
source: Expense
he: הוצאה

# transactionTypeIncome
source: Income
he: הכנסה

# transactionFormTitleNew
source: Add transaction
he: הוספת תנועה

# transactionFormTitleEdit
source: Edit transaction
he: עריכת תנועה

# transactionFormAmountLabel
source: Amount
he: סכום

# transactionFormAmountError
source: Enter a valid amount greater than zero
he: נא להזין סכום תקף גדול מאפס

# transactionFormCategoryLabel
source: Category
he: קטגוריה

# transactionFormTypeLabel
source: Type
he: סוג

# transactionFormDateLabel
source: Date
he: תאריך

# transactionFormNoteLabel
source: Notes
he: הערות

# transactionFormMerchantLabel
source: Merchant
he: בית עסק

# transactionFormSave
source: Save
he: שמירה

# transactionFormUpdate
source: Update
he: עדכון

# transactionFormDelete
source: Delete
he: מחיקה

# transactionDeleteConfirmTitle
source: Delete transaction
he: מחיקת תנועה

# transactionDeleteConfirmMessage
source: Are you sure you want to remove this transaction? This action cannot be undone.
he: האם למחוק את התנועה? פעולה זו אינה הפיכה.

# transactionDeleteConfirmConfirm
source: Delete
he: מחק

# transactionDeleteConfirmCancel
source: Cancel
he: ביטול

# transactionsNoCategoriesHelper
source: Create a category first to classify this transaction.
he: צרו קטגוריה לפני שתסווגו את התנועה.

# transactionsAiProcessing
source: Processing invoice…
he: החשבונית מעובדת...

# transactionsAiResultTitle
source: AI suggestions
he: הצעות מהבינה

# transactionsAiNoResults
source: No items detected in the invoice. Try again with a clearer photo.
he: לא נמצאו פריטים בחשבונית. נסו צילום ברור יותר.

# transactionsAiResultApply
source: Use suggestion
he: השתמש בהצעה

# transactionsAiAppliedSuccess
source: Transaction added from AI suggestion.
he: העסקה נוספה מהמלצת ה-AI.

# budgetTitle
source: Budget Envelopes
he: מעטפות תקציב

# budgetSubtitle
source: Allocate every shekel and track remaining amounts in each category.
he: הקצו כל שקל ועקבו אחר הסכומים שנותרו בכל קטגוריה.

# budgetPlaceholder
source: Budget envelopes coming soon.
he: מעטפות התקציב יופיעו כאן בקרוב.

# budgetIncomeHeading
source: Income
he: הכנסות

# budgetNeedsHeading
source: Needs
he: צרכים

# budgetWantsHeading
source: Wants
he: רצונות

# budgetLoansHeading
source: Loans
he: הלוואות

# budgetTotalsIncomeReceived
source: Income received
he: הכנסות שהתקבלו

# budgetTotalsBudgeted
source: Budgeted
he: סך התקציב

# budgetTotalsSpent
source: Spent
he: הוצאות בפועל

# budgetTotalsAvailable
source: Available to budget
he: זמין לתקצוב

# budgetAddCategory
source: Add category
he: הוספת קטגוריה

# budgetEditCategory
source: Edit category
he: עריכת קטגוריה

# budgetNoCategoriesTitle
source: No budget envelopes yet
he: אין מעטפות תקציב עדיין

# budgetNoCategoriesSubtitle
source: Create your first category to start allocating every shekel with Zero-Based Budgeting.
he: צרו קטגוריה ראשונה כדי להתחיל לתקצב כל שקל בשיטת האפס.

# budgetCategoryNameLabel
source: Category name
he: שם הקטגוריה

# budgetCategoryTargetLabel
source: Target amount
he: סכום יעד

# budgetCategoryTypeLabel
source: Type
he: סוג

# budgetCategoryTypeNeed
source: Need
he: צורך

# budgetCategoryTypeWant
source: Want
he: רצון

# budgetCategoryTypeLoan
source: Loan
he: הלוואה

# budgetCategoryTypeIncome
source: Income
he: הכנסה

# budgetCategorySave
source: Save
he: שמירה

# budgetCategoryUpdate
source: Update
he: עדכון

# budgetCategoryDelete
source: Delete
he: מחיקה

# budgetCategoryDeleteConfirmTitle
source: Delete category
he: מחיקת קטגוריה

# budgetCategoryDeleteConfirmMessage
source: Deleting this category will remove its budget target. Existing transactions remain untouched.
he: מחיקת הקטגוריה תסיר את יעד התקציב שלה. התנועות הקיימות אינן נפגעות.

# budgetCategoryDeleteConfirmCancel
source: Cancel
he: ביטול

# budgetCategoryDeleteConfirmConfirm
source: Delete
he: מחק

# budgetCategoryAmountError
source: Enter a valid amount greater than zero
he: נא להזין סכום תקף גדול מאפס

# assistantTitle
source: BudgetPal Assistant
he: העוזר של BudgetPal

# assistantSubtitle
source: Ask for help with budgets, transactions, and app settings.
he: שאלו על תקציבים, תנועות והגדרות באפליקציה.

# assistantPlaceholder
source: What would you like to know about BudgetPal?
he: על מה תרצו לדעת ב-BudgetPal?

# assistantSuggestedHeading
source: Try asking about:
he: אפשר לשאול למשל:

# assistantSuggestedTransactions
source: How do I add a new transaction?
he: איך מוסיפים תנועה חדשה?

# assistantSuggestedBudget
source: What do the budget sections mean?
he: מה משמעות סעיפי התקציב?

# assistantSuggestedInvoice
source: How does AI invoice import work?
he: איך עובד ייבוא החשבוניות באמצעות AI?

# assistantThinking
source: Thinking…
he: חושב…

# assistantProviderMissing
source: Connect BudgetPal to an AI provider to unlock smarter answers.
he: חברו את BudgetPal לספק בינה מלאכותית כדי לקבל תשובות חכמות יותר.

# assistantApiError
source: I ran into a problem reaching our AI service.
he: נתקלתי בבעיה בהגעה לשירות הבינה המלאכותית שלנו.

# assistantFallbackIntro
source: Here's a quick BudgetPal tip meanwhile:
he: בינתיים הנה טיפ מהיר מ-BudgetPal:

# assistantClearChat
source: Clear chat
he: נקה צ׳אט

# assistantInputHint
source: Type your question about BudgetPal
he: הקלידו שאלה על BudgetPal

# assistantCannotAnswer
source: I can help with BudgetPal features. Try asking about budgets, transactions, or settings.
he: אני יכול לעזור רק בנושאים שקשורים ל-BudgetPal. נסו לשאול על תקציבים, תנועות או הגדרות.

# assistantSendButton
source: Send
he: שלח

# profileTitle
source: Profile & Settings
he: פרופיל והגדרות

# profileSubtitle
source: Manage your account details, balances, and preferences.
he: נהלו את פרטי החשבון, היתרות והעדפותיכם.

# profilePlaceholder
source: Profile settings coming soon.
he: הגדרות הפרופיל יופיעו כאן בקרוב.

# profileFinancialSectionTitle
source: Balances
he: יתרות

# profileFinancialSectionDescription
source: Update your current bank balance and available overdraft.
he: עדכנו את יתרת הבנק הנוכחית ואת מסגרת היתר הזמינה.

# profileBankBalanceLabel
source: Bank balance
he: יתרת בנק

# profileBankBalanceInvalid
source: Enter a valid balance.
he: הזינו יתרה חוקית.

# profileOverdraftLabel
source: Overdraft limit
he: מסגרת אשראי

# profileOverdraftInvalid
source: Enter a valid overdraft of zero or more.
he: הזינו מסגרת אשראי חוקית הגדולה או שווה לאפס.

# profileOverdraftHelper
source: Enter the maximum overdraft you can access. Leave 0 if it does not apply.
he: הזינו את מסגרת האשראי המרבית. השאירו 0 אם לא רלוונטי.

# profileFormSave
source: Save changes
he: שמור שינויים

# profileFormReset
source: Revert
he: בטל

# profileUpdateSuccess
source: Profile updated successfully.
he: הפרופיל עודכן בהצלחה.

# profileUpdateError
source: We couldn't update your profile. Try again shortly.
he: לא הצלחנו לעדכן את הפרופיל. נסו שוב מאוחר יותר.

# profilePreferencesSectionTitle
source: Preferences
he: העדפות

# profileThemeOptionLight
source: Light
he: בהיר

# profileThemeOptionDark
source: Dark
he: כהה

# profileThemeOptionSystem
source: System
he: מערכת

# profileLocaleLabel
source: Language
he: שפה

# profileAccountSectionTitle
source: Account
he: חשבון

# profileAccountEmailLabel
source: Email
he: דוא"ל

# profileResetPasswordButton
source: Send password reset
he: שלח קישור לאיפוס סיסמה

# profilePasswordResetSent
source: Password reset email sent.
he: קישור לאיפוס סיסמה נשלח.

# profilePasswordResetError
source: We couldn't send the reset email. Try again later.
he: לא ניתן לשלוח את קישור האיפוס. נסו שוב מאוחר יותר.

# profileSignOutConfirmTitle
source: Sign out?
he: להתנתק?

# profileSignOutConfirmMessage
source: You'll return to the sign-in screen. Unsaved changes will be lost.
he: תחזרו למסך הכניסה. שינויים שלא נשמרו יאבדו.

# profileSignOutConfirmConfirm
source: Sign out
he: התנתק

# profileSignOutConfirmCancel
source: Stay
he: הישאר

# authErrorInvalidCredentials
source: The email or password you entered is incorrect.
he: האימייל או הסיסמה אינם נכונים.

# authErrorUserDisabled
source: This account has been disabled. Contact support if this is unexpected.
he: החשבון הזה הושבת. פנו לתמיכה במידה וזה מפתיע.

# authErrorUserNotFound
source: No account exists for that email address.
he: לא נמצא חשבון עבור כתובת אימייל זו.

# authErrorTooManyRequests
source: Too many attempts. Please try again later.
he: בוצעו יותר מדי ניסיונות. נסו שוב מאוחר יותר.

# authErrorEmailAlreadyInUse
source: An account already exists with this email address.
he: כבר קיים חשבון עם כתובת אימייל זו.

# authErrorWeakPassword
source: Choose a stronger password to protect your account.
he: בחרו סיסמה חזקה יותר להגנה על החשבון.

# authErrorUsernameTaken
source: That username is already taken.
he: שם המשתמש כבר תפוס.

# authErrorUnknown
source: Unable to complete the request. Try again in a moment.
he: לא ניתן להשלים את הבקשה. נסו שוב בעוד רגע.
